000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийИнтернетЗаказа/КомментарийИнтернетЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарийИнтернетЗаказа</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументКоментария</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусКомментария</name>
    <type>
      <types>EnumRef.СтатусыКомментария</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыКомментария/СтатусыКомментария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКомментария</name>
  <enumValues>
    <name>Системное</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>Пользовательское</name>
  </enumValues>
  <enumValues>
    <name>Важные</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийИнтернетЗаказа/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ПросмотрКомментария") Тогда 
		ТолькоПросмотр = Истина;
		Запись.Автор = Параметры.ДанныеДляПросмотра.Автор;
		Запись.ДокументКоментария = Параметры.ЗаказКлиента;
		Запись.Комментарий = Параметры.ДанныеДляПросмотра.Комментарий; 
		Важный = ?(Параметры.ДанныеДляПросмотра.СтатусКомментария = Перечисления.СтатусыКомментария.Важные, 2, 1);
	Иначе
		Если Параметры.Свойство("ЗаказКлиента") Тогда 
			Запись.ДокументКоментария = Параметры.ЗаказКлиента;
		КонецЕсли;
		
		Запись.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ТолькоПросмотр Тогда 
		Запись.Период = ТекущаяДата();  
		Запись.СтатусКомментария = ?(Важный = 1
									, ПредопределенноеЗначение("Перечисление.СтатусыКомментария.Пользовательское")
									, ПредопределенноеЗначение("Перечисление.СтатусыКомментария.Важные"));
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ВажныйПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
